2018-10-26-datafy-and-tap>-in-clojure-1.10.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.birkey.co/rss.xml"
      title="RSS feed for https://www.birkey.co/">
<title>Datafy and tap> in Clojure 1.10</title>
<meta name="author" content="Kasim Tuman">
	     <meta name="referrer" content="no-referrer">
	     <link href= "static/style.css" rel="stylesheet" type="text/css" />
	     <link rel="icon" href="static/favicon.ico">
	     <link rel="apple-touch-icon-precomposed" href="static/birkey_logo.png">
	     <link rel="msapplication-TitleImage" href="static/birkey_logo.png">
	     <link rel="msapplication-TitleColor" href="#0141ff">
	     <link rel="alternate" type="application/rss+xml"  title="RSS Feed for birkey.co" href="/rss.xml"
	     <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
	     <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><br><center>
    <div style="display: inline-block; vertical-align:middle;">
<a href="https://www.birkey.co/index.html" style="text-decoration: none;"><b>BIRKEY CONSULTING</b><br>
</a><hr/><div style="text-align: justify;display: inline-block; width: 100%;">
<a class="title" href="https://www.birkey.co/resume/resume.html">ABOUT</a> &nbsp;<a class="title" href="https://github.com/oneness">GITHUB</a> &nbsp;<a class="title" href="https://www.birkey.co/rss.xml">RSS</a> &nbsp;<a class="title" href="https://www.birkey.co/archive.html">ARCHIVE</a> &nbsp;<a class="title" href="https://paypal.me/ktuman">DONATE</a></div></div>
</center><br><br>
<div style="margin-bottom: 3ch;text-transform: none;"></div></div>
<div id="content">
<div class="post-date">26 Oct 2018</div><h1 class="post-title"><a href="https://www.birkey.co/2018-10-26-datafy-and-tap>-in-clojure-1.10.html">Datafy and tap> in Clojure 1.10</a></h1>
<p>
I noticed couple of new features being added to Clojure 1.10. One is
<b>tap</b>, which is added to the core ns, and the other is <b>datafy</b>, which
is added to clojure.datafy ns.  
</p>

<p>
<b>tap</b> essentially is an atom holding set of fns of single arity, which
will be asynchronously called on any value you you send via
<b>tap&gt;</b>. You can add a single arity fn to the <b>tap</b> via <b>(add-tap f)</b>
and remove the fn via <b>(remove-tap f</b>).  Note that you have to
remember the fn you added so you can remove it. Otherwise, you have no
way of removing the fn, which is an inconvenience but there might be a
reason why it is the way it is. I am not sure about its intended use
cases but I know it comes handy when you have a set of transformation
(<b>important: order of those transformation should not matter</b>) that you
would like to apply to any value asynchronously. I can think of
following uses cases for tap:
</p>
<ul class="org-ul">
<li>Collecting some sort of diagnostic information about running system.</li>
<li>Streaming serious of values to be processed and routed to a sink somewhere.</li>
<li>May be used (rather abused) to execute some code? hope not.</li>
</ul>
<p>
Enough being said, let us see with a simple example to cover first
uses case I said above. 
</p>
<div class="org-src-container">
<pre class="src src-clojure">(def context (StringBuilder.))

(defn -&gt;context [x]
  (doto context
    (.append x)))

;; Then let us add above fn to the tapset
(add-tap -&gt;context)
;; Then from any where of our running code, we can do:
(tap&gt; "******* tap start ********\n ")
(tap&gt; "runing.......................\n")
(tap&gt; "******* tap end **********\n ")

;; It will be executed in a separate dedicated thread and will not
;; block or interfere with our running code. Then we print out the context:
(str context)
;; which results in:
;;******* tap start ********
;; runing.......................
;;******* tap end **********

;; Remember to remove the -&gt;context fn once you are done with that session:
(remove-tap -&gt;context)
;; If there is no fn added to the tap, any values you send to tap will be discarded.
(tap&gt; "your magic") ;; your magic will be discarded.

</pre>
</div>

<p>
The other one I noticed is <b>datafy</b>, which I am more excited about. I
am already using it to find out about java classes members, methods
and its object graph. Let us take a java class <b>String</b> as an example.
</p>
<div class="org-src-container">
<pre class="src src-clojure">(require '[clojure.datafy :as d])
(d/datafy String) ;; which will print all about its members in a nice clojure ds

;; let us write an fn to give use any member that we would like to find more about:
(defn member-lookup [class member]
  (-&gt;&gt; class
       d/datafy
       :members
       (filter (fn [[k v]] (= (symbol member) k)))))
;; then use it to find about "intern"
(member-lookup String "intern")
;; returns:
([intern
  [{:name intern,
    :return-type java.lang.String,
    :declaring-class java.lang.String,
    :parameter-types [],
    :exception-types [],
    :flags #{:public :native}}]])

;; One can learn a lot about this method from above ds. "intern" is a
;; public native method that takes no argument, called on string object
;; and returns string like this:
(.intern "test") ;; =&gt; "test"

</pre>
</div>

<p>
This means we can use above information to create Clojure fns on the
fly for java inter-op. One great use case would be to generate Clojure
fns out of AWS Java SDK, which I might do if time permits.
</p>
<div class="taglist"><a href="https://www.birkey.co/tags.html">Tags</a>: <a href="https://www.birkey.co/tag-clojure.html">clojure</a> </div></div>
<div id="postamble" class="status"><br><center>
	   <div style="display: inline-block; vertical-align:middle;"></div></div>
</body>
</html>
